import React from "react"
import "./Description.css"

const Description = () => (
  <div className={"Description"}>
    <p>
      За даними перепису населення 2001 року кількість українців складала 48 млн. 457 тис. осіб. Це на вісім мільйонів
      більше за теперішнє число. За час незалежності українців поменшало на цілих 10 мільйонів. Чим зумовлений такий
      спад?
    </p>
    <p>
      У 1990 році найчисельнішим сегментом були люди, народжені перед початком ІІ-ої світової війни. В той час їм було
      близько 50 років, а їх кількість була в середньому на 200 тисяч більшою, ніж новонароджених. Зараз “дітям війни”
      більше 75 років, пік “згас” - почав старіти і вмирати. В той же час, за останні двадцять років кількість немовлят
      стрімко знизилась. Якщо у 1990 було зареєстровано близько 690 тисяч народжених, у 2018 році ця цифра становила
      близько 360 тисяч, тобто вдвічі менше.
    </p>
    <p>
      Сьогодні на графіку населення є два майже однакові підйоми. Перший - люди віком близько 57 років. Більше за них
      лише молоді 30-35 років. На одну особу з другої “категорії” припадає трошки менше однієї людини із першої. За цим
      підвищенням слідує спад - на віковому проміжку 0-30 графік опускається майже вдвічі. Зовсім скоро люди із першого
      “підйому” стануть пенсіонерами. В той час основну частку соціально активного населення займатимуть українці віком
      приблизно 40 років. Та судячи за тенденцією до зниження кількості людей, за 20 років пік населення України
      ймовірно представлятимуть пенсіонери.
    </p>
    <p>
      Сірі градації на візуалізації відображають відтік населення певного віку відносно попереднього року. Дані 1990
      року є нестандартними, адже на графіку доволі багато сірих зон. Більшість людей похилого віку найімовірніше просто
      померла. “Винуватцем” темних смуг для соціально активного населення скоріш за все була еміграція. Інші аномальні
      дані приніс 2015 рік - усе населення країни затемнене сірим. Причина цьому - війна та анексія Криму. Через
      захоплення території, збір даних для цієї частини України є неможливим.{" "}
    </p>
    <p>
      Цікаво прослідковується співвідношення кількості чоловіків та жінок. Впродовж останніх двадцяти років хлопчиків
      завжди народжується трошки більше. Приблизно до віку 30-35 років цифри вирівнюються. Після цього кількість жінок
      починає переважати, стаючи до 80 років більш ніж вдвічі вищою за кількість чоловіків.
    </p>
    <br />
    <i>
      Дані для візуалізації взято з{" "}
      <a href={"http://database.ukrcensus.gov.ua/PXWEB2007/"}>Єдиного Державного веб-порталу відкритих даних</a>
    </i>
  </div>
)

export default Description
